[
  {
    "id": 1,
    "title": "Cheese Curry Recipe",
    "image": "",
    "description": "A flavorful and creamy cheese curry that's perfect for a cozy dinner.",
    "ingredients": [
      "200g paneer (Indian cheese), cubed",
      "1 onion, finely chopped",
      "2 tomatoes, pureed",
      "1/2 cup yogurt",
      "1 tsp ginger-garlic paste",
      "1 tsp cumin seeds",
      "1 tsp coriander powder",
      "1/2 tsp turmeric powder",
      "1/2 tsp red chili powder",
      "1/2 cup cream",
      "Salt to taste",
      "2 tbsp oil",
      "Fresh coriander leaves for garnish"
    ],
    "instructions": "1. Heat oil in a pan. Add cumin seeds and let them splutter.\n2. Add chopped onions and sauté until golden brown.\n3. Add ginger-garlic paste and sauté for a minute.\n4. Add tomato puree and cook until the oil separates.\n5. Add coriander powder, turmeric powder, red chili powder, and salt. Mix well.\n6. Add yogurt and cook until the mixture thickens.\n7. Add cream and paneer cubes. Simmer for 5 minutes.\n8. Garnish with fresh coriander leaves and serve hot with rice or naan."
  },
  {
    "id": 2,
    "title": "Potato Tomato Vegetable Recipe",
    "image": "https://th.bing.com/th/id/OIP.sPeyITmvV4VCQYI9vbiTdwHaHa?w=190&h=191&c=7&r=0&o=5&dpr=1.3&pid=1.7",
    "description": "A simple and nutritious vegetable dish made with potatoes and tomatoes.",
    "ingredients": [
      "3 potatoes, peeled and diced",
      "2 tomatoes, chopped",
      "1 onion, finely chopped",
      "2 green chilies, chopped",
      "1/2 tsp cumin seeds",
      "1/2 tsp turmeric powder",
      "1/2 tsp red chili powder",
      "Salt to taste",
      "2 tbsp oil",
      "Fresh coriander leaves for garnish"
    ],
    "instructions": "1. Heat oil in a pan. Add cumin seeds and let them splutter.\n2. Add chopped onions and green chilies. Sauté until onions are translucent.\n3. Add diced potatoes, turmeric powder, red chili powder, and salt. Mix well.\n4. Cook covered on medium heat until potatoes are tender.\n5. Add chopped tomatoes and cook for another 5 minutes.\n6. Garnish with fresh coriander leaves and serve hot with roti or rice."
  },
  {
    "id": 3,
    "title": "Cabbage Recipe",
    "image": "",
    "description": "A simple and tasty cabbage stir-fry that's quick to make.",
    "ingredients": [
      "1 small cabbage, thinly sliced",
      "1 onion, thinly sliced",
      "2 green chilies, chopped",
      "1/2 tsp mustard seeds",
      "1/2 tsp cumin seeds",
      "1/2 tsp turmeric powder",
      "Salt to taste",
      "2 tbsp oil",
      "Fresh coriander leaves for garnish"
    ],
    "instructions": "1. Heat oil in a pan. Add mustard seeds and cumin seeds. Let them splutter.\n2. Add chopped onions and green chilies. Sauté until onions turn golden brown.\n3. Add sliced cabbage, turmeric powder, and salt. Mix well.\n4. Cook covered on low heat until cabbage is tender, stirring occasionally.\n5. Garnish with fresh coriander leaves and serve hot with roti or rice."
  },
  {
    "id": 4,
    "title": "Cauliflower Recipe",
    "image": "https://th.bing.com/th/id/OIP.WvqbByaDzjobOM5zNwmKfgHaFj?w=182&h=136&c=7&r=0&o=5&dpr=1.3&pid=1.7",
    "description": "A delicious and healthy cauliflower dish that's perfect as a side or main.",
    "ingredients": [
      "1 medium cauliflower, cut into florets",
      "1 onion, finely chopped",
      "2 tomatoes, chopped",
      "1 tsp ginger-garlic paste",
      "1/2 tsp turmeric powder",
      "1 tsp cumin powder",
      "1 tsp coriander powder",
      "1/2 tsp red chili powder",
      "Salt to taste",
      "2 tbsp oil",
      "Fresh coriander leaves for garnish"
    ],
    "instructions": "1. Heat oil in a pan. Add chopped onions and sauté until golden brown.\n2. Add ginger-garlic paste and sauté for a minute.\n3. Add chopped tomatoes and cook until soft and mushy.\n4. Add turmeric powder, cumin powder, coriander powder, red chili powder, and salt. Mix well.\n5. Add cauliflower florets and toss to coat with the spice mixture.\n6. Cover and cook on medium heat until cauliflower is tender, stirring occasionally.\n7. Garnish with fresh coriander leaves and serve hot with chapati or rice."
  },
  {
    "id": 5,
    "title": "Palak Paneer Recipe",
    "image": "https://th.bing.com/th/id/OIP.pfQyDlLgjXZC4Qr4I3SNkwHaE8?w=254&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7",
    "description": "A classic Indian dish made with spinach and paneer (Indian cottage cheese).",
    "ingredients": [
      "500g fresh spinach, washed and chopped",
      "200g paneer (Indian cottage cheese), cubed",
      "1 onion, finely chopped",
      "2 tomatoes, pureed",
      "1 tsp ginger-garlic paste",
      "1 tsp cumin seeds",
      "1 tsp coriander powder",
      "1/2 tsp turmeric powder",
      "1/2 tsp red chili powder",
      "Salt to taste",
      "2 tbsp oil",
      "Fresh cream or butter (optional)"
    ],
    "instructions": "1. Heat oil in a pan. Add cumin seeds and let them splutter.\n2. Add chopped onions and sauté until golden brown.\n3. Add ginger-garlic paste and sauté for a minute.\n4. Add tomato puree and cook until the oil separates.\n5. Add coriander powder, turmeric powder, red chili powder, and salt. Mix well.\n6. Add chopped spinach and cook until wilted, stirring occasionally.\n7. Once the spinach is cooked, blend it into a smooth puree.\n8. Return the spinach puree to the pan and add paneer cubes.\n9. Simmer for 5-10 minutes, adjusting seasoning if needed.\n10. Garnish with fresh cream or butter (optional) and serve hot with roti or naan."
  },
  {
    "id": 6,
    "title": "Vegetable Kofta Curry",
    "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2022/01/veg-kofta-curry-2.jpg",
    "description": "Delicious vegetable koftas (dumplings) simmered in a rich and creamy curry sauce.",
    "ingredients": [
      "For the koftas:",
      "1 cup grated vegetables (potatoes, carrots, beans)",
      "1/2 cup breadcrumbs",
      "1 tsp garam masala",
      "1/2 tsp red chili powder",
      "Salt to taste",
      "Oil for frying",
      "For the curry:",
      "1 onion, finely chopped",
      "2 tomatoes, pureed",
      "1 tsp ginger-garlic paste",
      "1 tsp coriander powder",
      "1/2 tsp cumin powder",
      "1/2 cup yogurt or cream",
      "Salt to taste",
      "2 tbsp oil"
    ],
    "instructions": "1. Make the kofta mixture by mixing grated vegetables, breadcrumbs, garam masala, red chili powder, and salt. Shape into small balls. 2. Fry the koftas in hot oil until golden brown. 3. For the curry, heat oil in a pan, add chopped onions and sauté until golden brown. 4. Add ginger-garlic paste and sauté for a minute. 5. Add tomato puree and cook until the oil separates. 6. Add coriander powder, cumin powder, and salt. Mix well. 7. Add yogurt/cream and fried koftas. Simmer for 10 minutes. 8. Garnish with fresh coriander leaves and serve hot with naan or rice."
  },
  {
    "id": 7,
    "title": "Vegetable Biryani",
    "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2021/05/veg-biryani-2.jpg",
    "description": "A flavorful and aromatic vegetable biryani made with basmati rice and a blend of spices.",
    "ingredients": [
      "2 cups basmati rice",
      "1 cup mixed vegetables (carrots, beans, cauliflower, peas)",
      "1 onion, sliced",
      "2 tomatoes, chopped",
      "1 tsp ginger-garlic paste",
      "2 green chilies, slit",
      "2 tsp biryani masala powder",
      "1 tsp garam masala powder",
      "1/2 cup yogurt",
      "Salt to taste",
      "4 tbsp oil or ghee",
      "Fresh coriander leaves for garnish"
    ],
    "instructions": "1. Soak the basmati rice in water for 30 minutes. 2. Heat oil/ghee in a pot, add sliced onions and fry until golden brown. 3. Add ginger-garlic paste and sauté for a minute. 4. Add chopped tomatoes and cook until mushy. 5. Add biryani masala, garam masala, green chilies, and salt. Mix well. 6. Add the mixed vegetables and yogurt. Cook for 5 minutes. 7. Layer the rice and vegetable mixture in a pot, starting and ending with rice. 8. Add water/stock as needed. 9. Cover and cook on low heat for 20-25 minutes. 10. Garnish with coriander leaves and serve hot."
  },
  {
    "id": 8,
    "title": "Mushroom Masala",
    "image": "https://www.cubesnjuliennes.com/wp-content/uploads/2020/10/Mushroom-Masala-Recipe-2.jpg",
    "description": "A rich and flavorful mushroom curry made with a blend of aromatic spices.",
    "ingredients": [
      "500g fresh mushrooms, sliced",
      "1 onion, finely chopped",
      "2 tomatoes, pureed",
      "1 tsp ginger-garlic paste",
      "1 tsp cumin seeds",
      "1 tsp coriander powder",
      "1/2 tsp turmeric powder",
      "1/2 tsp red chili powder",
      "1/2 cup yogurt or cream",
      "Salt to taste",
      "2 tbsp oil",
      "Fresh coriander leaves for garnish"
    ],
    "instructions": "1. Heat oil in a pan, add cumin seeds and let them splutter. 2. Add chopped onions and sauté until golden brown. 3. Add ginger-garlic paste and sauté for a minute. 4. Add tomato puree and cook until the oil separates. 5. Add coriander powder, turmeric powder, red chili powder, and salt. Mix well. 6. Add sliced mushrooms and yogurt/cream. Cook for 10 minutes. 7. Garnish with fresh coriander leaves and serve hot with rice or naan."
  },
  {
    "id": 9,
    "title": "Baingan Bharta",
    "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2021/07/baingan-bharta-1.jpg",
    "description": "A smoky and delicious roasted eggplant dish from North Indian cuisine.",
    "ingredients": [
      "2 large eggplants",
      "1 onion, finely chopped",
      "2 tomatoes, chopped",
      "1 tsp ginger-garlic paste",
      "1 tsp cumin powder",
      "1 tsp coriander powder",
      "1/2 tsp red chili powder",
      "Salt to taste",
      "2 tbsp oil",
      "Fresh coriander leaves for garnish"
    ],
    "instructions": "1. Roast the eggplants on an open flame or in the oven until charred and soft. 2. Once cool, peel and mash the eggplants. 3. Heat oil in a pan, add cumin seeds and let them splutter. 4. Add chopped onions and sauté until golden brown. 5. Add ginger-garlic paste and sauté for a minute. 6. Add chopped tomatoes and cook until mushy. 7. Add cumin powder, coriander powder, red chili powder, and salt. Mix well. 8. Add the mashed eggplant and mix everything together. 9. Cook for 5 minutes, adjusting seasoning if needed. 10. Garnish with fresh coriander leaves and serve hot with roti or naan."
  },
  {
    "id": 10,
    "title": "Gobi Paratha",
    "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2022/02/gobi-paratha-2.jpg",
    "description": "A delicious and nutritious stuffed flatbread made with cauliflower and spices.",
    "ingredients": [
      "For the dough:",
      "2 cups whole wheat flour",
      "1 tsp salt",
      "Water for kneading",
      "For the stuffing:",
      "1 cup grated cauliflower",
      "1 onion, finely chopped",
      "1 tsp ginger-garlic paste",
      "1 tsp coriander powder",
      "1/2 tsp cumin powder",
      "1/2 tsp red chili powder",
      "Salt to taste",
      "2 tbsp oil",
      "Fresh coriander leaves for garnish"
    ],
    "instructions": "1. Make the dough by mixing flour, salt, and water. Knead into a smooth dough and set aside. 2. Heat oil in a pan, add chopped onions and sauté until golden brown. 3. Add ginger-garlic paste and sauté for a minute. 4. Add grated cauliflower, coriander powder, cumin powder, red chili powder, and salt. Mix well and cook for 5 minutes. 5. Divide the dough and stuffing into equal portions. 6. Roll out a portion of the dough, place the stuffing in the center, and seal the edges to make a paratha. 7. Cook the parathas on a hot tawa/griddle until golden brown on both sides. 8. Serve hot with curd, pickle, or any other accompaniment."
  },
  {
    "id": 11,
    "title": "Chana Batura",
    "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2022/03/chana-bhatura-2.jpg",
    "description": "A classic North Indian dish of spicy chickpea curry served with fluffy deep-fried bread (batura).",
    "ingredients": [
      "For the chana (chickpea curry):",
      "1 cup dried chickpeas, soaked overnight",
      "1 onion, finely chopped",
      "2 tomatoes, chopped",
      "1 tsp ginger-garlic paste",
      "1 tsp cumin powder",
      "1 tsp coriander powder",
      "1 tsp red chili powder",
      "Salt to taste",
      "2 tbsp oil",
      "For the batura:",
      "2 cups all-purpose flour",
      "1 tsp salt",
      "1 tsp baking soda",
      "Water for kneading",
      "Oil for frying"
    ],
    "instructions": "1. For the chana: Cook the soaked chickpeas in a pressure cooker until soft. 2. Heat oil in a pan, add chopped onions and sauté until golden brown. 3. Add ginger-garlic paste and sauté for a minute. 4. Add chopped tomatoes and cook until mushy. 5. Add cumin powder, coriander powder, red chili powder, and salt. Mix well. 6. Add the cooked chickpeas and simmer for 10 minutes. 7. For the batura: Mix flour, salt, baking soda, and water to make a smooth dough. 8. Divide the dough into equal portions and roll out into circles. 9. Deep fry the baturas in hot oil until golden brown and puffed up. 10. Serve the chana curry hot with baturas."
  },
  {
    "id": 12,
    "title": "Vegetable Jalfrezi",
    "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2022/04/vegetable-jalfrezi-2.jpg",
    "description": "A flavorful and spicy vegetable stir-fry dish from North Indian cuisine.",
    "ingredients": [
      "1 cup mixed vegetables (bell peppers, carrots, cauliflower, onions)",
      "1 onion, sliced",
      "2 tomatoes, chopped",
      "1 tsp ginger-garlic paste",
      "2 green chilies, slit",
      "1 tsp cumin seeds",
      "1 tsp coriander powder",
      "1 tsp garam masala powder",
      "1/2 tsp red chili powder",
      "Salt to taste",
      "2 tbsp oil",
      "Fresh coriander leaves for garnish"
    ],
    "instructions": "1. Heat oil in a pan, add cumin seeds and let them splutter. 2. Add sliced onions and sauté until golden brown. 3. Add ginger-garlic paste and green chilies, sauté for a minute. 4. Add chopped tomatoes and cook until mushy. 5. Add coriander powder, garam masala, red chili powder, and salt. Mix well. 6. Add mixed vegetables and toss to coat with the spice mixture. 7. Cover and cook on medium heat until vegetables are tender, stirring occasionally. 8. Garnish with fresh coriander leaves and serve hot with naan or roti."
  },
  {
    "id": 13,
    "title": "Dal Makhani",
    "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2020/12/dal-makhani-2.jpg",
    "description": "A rich and creamy lentil dish from Punjabi cuisine, made with black lentils and butter.",
    "ingredients": [
      "1 cup whole black lentils (urad dal)",
      "1/2 cup kidney beans (rajma)",
      "1 onion, finely chopped",
      "2 tomatoes, pureed",
      "1 tsp ginger-garlic paste",
      "1 tsp cumin seeds",
      "1 tsp coriander powder",
      "1/2 tsp red chili powder",
      "Salt to taste",
      "2 tbsp butter or ghee",
      "Fresh cream for garnish"
    ],
    "instructions": "1. Soak the black lentils and kidney beans separately for at least 6 hours. 2. Pressure cook the soaked lentils and beans separately with a pinch of salt until soft. 3. Heat butter/ghee in a pan, add cumin seeds and let them splutter. 4. Add chopped onions and sauté until golden brown. 5. Add ginger-garlic paste and sauté for a minute. 6. Add tomato puree and cook until the oil separates. 7. Add coriander powder, red chili powder, and salt. Mix well. 8. Add the cooked lentils and beans along with their cooking liquid. 9. Simmer for 10-15 minutes, adjusting seasoning if needed. 10. Garnish with fresh cream and serve hot with naan or rice."
  },
  {
    "id": 14,
    "title": "Veg Hakka Noodles",
    "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2022/04/veg-hakka-noodles-1.jpg",
    "description": "A popular Indo-Chinese dish made with stir-fried vegetables and noodles.",
    "ingredients": [
      "250g noodles",
      "1 cup mixed vegetables (cabbage, carrots, bell peppers, beans)",
      "1 onion, sliced",
      "2 green chilies, chopped",
      "2 cloves garlic, minced",
      "1 tsp soy sauce",
      "1 tsp vinegar",
      "1 tsp chili sauce",
      "Salt to taste",
      "2 tbsp oil",
      "Fresh spring onions for garnish"
    ],
    "instructions": "1. Cook the noodles according to package instructions, drain and set aside. 2. Heat oil in a wok or pan, add minced garlic and chopped green chilies. Sauté for a minute. 3. Add sliced onions and sauté until translucent. 4. Add mixed vegetables and stir-fry for 2-3 minutes. 5. Add soy sauce, vinegar, chili sauce, and salt. Mix well. 6. Add the cooked noodles and toss everything together. 7. Cook for 2-3 minutes, adjusting seasoning if needed. 8. Garnish with fresh spring onions and serve hot."
  },
  {
    "id": 15,
    "title": "Masala Dosa",
    "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2021/04/masala-dosa-recipe-2.jpg",
    "description": "A popular South Indian dish made with a crispy dosa (savory crepe) filled with a flavorful potato masala.",
    "ingredients": [
      "For the dosa batter:",
      "1 cup rice",
      "1/2 cup urad dal (black lentils)",
      "1 tsp fenugreek seeds",
      "Salt to taste",
      "For the potato masala:",
      "3 potatoes, boiled and mashed",
      "1 onion, finely chopped",
      "1 tsp mustard seeds",
      "1 tsp cumin seeds",
      "2 green chilies, chopped",
      "1 tsp chana masala powder",
      "Salt to taste",
      "2 tbsp oil",
      "Fresh coconut chutney and sambar for serving"
    ],
    "instructions": "1. Soak the rice, urad dal, and fenugreek seeds separately for at least 6 hours. 2. Grind the soaked ingredients with salt to make a smooth dosa batter. 3. For the potato masala, heat oil in a pan, add mustard seeds and cumin seeds. Let them splutter. 4. Add chopped onions and green chilies, sauté until onions are translucent. 5. Add mashed potatoes, chana masala powder, and salt. Mix well and cook for 2-3 minutes. 6. Heat a dosa tawa/griddle, pour a ladle of dosa batter and spread it into a thin circle. 7. Cook until the edges turn crispy and the bottom is golden brown. 8. Spread a portion of the potato masala on one half of the dosa. 9. Fold the other half over the masala and serve hot with coconut chutney and sambar."
  }
]
